DROP TABLE IF EXISTS `ukraine_entity`;

CREATE TABLE `ukraine_entity` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `description` varchar(255) DEFAULT NULL,
  `region` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=45 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

LOCK TABLES `ukraine_entity` WRITE;
/*!40000 ALTER TABLE `ukraine_entity` DISABLE KEYS */;
INSERT INTO `ukraine_entity` (description, region) VALUES
('город Киев','AA'),
('город Киев','KA'),
('Винницкая область','AB'),
('Винницкая область','KB'),
('Волынская область','AC'),
('Волынская область','KC'),
('Днепропетровская область','AE'),
('Днепропетровская область','KE'),
('Донецкая область','AH'),
('Донецкая область','KH'),
('Киевская область','AI'),
('Киевская область','KI'),
('Автономная Республика Крым','AK'),
('Житомирская область','AM'),
('Житомирская область','KM'),
('Закарпатская область','AO'),
('Закарпатская область','KO'),
('Запорожская область','AP'),
('Запорожская область','KP'),
('Ивано-Франковская область','AT'),
('Ивано-Франковская область','KT'),
('Харьковская область','AX'),
('Харьковская область','KX'),
('Кировоградская область','BA'),
('Кировоградская область','HA'),
('Луганская область','BB'),
('Луганская область','HB'),
('Львовская область','BC'),
('Львовская область','HC'),
('Николаевская область','BE'),
('Николаевская область','HE'),
('Одесская область','BH'),
('Одесская область','HH'),
('Полтавская область','BI'),
('Полтавская область','HI'),
('Ровенская область','BK'),
('Ровенская область','HK'),
('Сумская область','BM'),
('Сумская область','HM'),
('Тернопольская область','BO'),
('Тернопольская область','HO'),
('Херсонская область','BT'),
('Херсонская область','HT'),
('Хмельницкая область','BX'),
('Хмельницкая область','HX'),
('Черкасская область','CA'),
('Черкасская область','IA'),
('Черниговская область','CB'),
('Черниговская область','IB'),
('Черновицкая область','CE'),
('Черновицкая область','IE'),
('город Севастополь','CH'),
('Общегосударственные номера','II');
UNLOCK TABLES;

ALTER TABLE ukraine_entity ADD INDEX ukraine_index (description, region);
